kurim/pulse-esp32-hwmonitor/main/display/display_ui.c
    // Rotation -> swap/mirror + Aufloesung. Fuer LCD_SHAPE_RECT (Landscape-
    // Kachel-UI) waehlt rotation die vier Landscape/Portrait-Faelle.
    //
    // LCD_SHAPE_ROUND hat keine Landscape/Portrait-Unterscheidung (Panel ist
    // quadratisch/rund) - rotation waehlt hier stattdessen direkt zwischen den
    // vier moeglichen Spiegel-Kombinationen (mirror_x/mirror_y einzeln bzw.
    // zusammen), da nicht vorhersagbar ist, welche Kombination bei einer
    // gegebenen Verbauung/Panel-Charge die richtige ist (mirror_x+mirror_y
    // zusammen ist KEIN garantiertes "richtig herum", sondern nur 180°
    // gegenueber mirror_x/mirror_y einzeln - je nach Scan-Richtung des
    // jeweiligen Panels kann das Ergebnis seitenverkehrt statt kopfueber
    // sein). Im Webportal einfach "Rotation" durchprobieren (0-3), bis
    // Text weder seitenverkehrt noch kopfueber erscheint - kein Neuflashen
    // noetig, die Auswahl greift nach dem naechsten Neustart.
    bool swap_xy = false, mirror_x = false, mirror_y = false;
    int hres = p->h_res, vres = p->v_res;
    if (p->shape == LCD_SHAPE_RECT) {
        switch (app_config.rotation) {
            case 0: swap_xy = false; mirror_x = false; mirror_y = false; hres = p->v_res; vres = p->h_res; break;
            case 2: swap_xy = false; mirror_x = true;  mirror_y = true;  hres = p->v_res; vres = p->h_res; break;
            case 3: swap_xy = true;  mirror_x = true;  mirror_y = true;  hres = p->h_res; vres = p->v_res; break;
            case 1:
            default: swap_xy = true; mirror_x = false; mirror_y = false; hres = p->h_res; vres = p->v_res; break;
        }
    } else if (p->shape == LCD_SHAPE_ROUND) {
        switch (app_config.rotation) {
            case 1:  mirror_x = true;  mirror_y = false; break;
            case 2:  mirror_x = false; mirror_y = true;  break;
            case 3:  mirror_x = true;  mirror_y = true;  break;
            case 0:
            default: mirror_x = false; mirror_y = false; break;
        }
    }
    s_hres = hres;
    s_vres = vres;

    lvgl_port_cfg_t pcfg = ESP_LVGL_PORT_INIT_CONFIG();
    LCD_CHECK(lvgl_port_init(&pcfg));

    lvgl_port_display_cfg_t dcfg = {
        .io_handle     = io,
        .panel_handle  = panel,
        // Einzelpuffer statt Doppelpuffer: keines der unterstuetzten Boards
        // hat PSRAM, ein zweiter Flush-Puffer wuerde internes SRAM verdoppeln.
        // LVGL wartet beim Flush dadurch synchron auf das SPI-DMA-Ende statt
        // vorzurendern - fuer eine Dashboard-UI mit wenigen Updates/Sekunde
        // kein spuerbarer Nachteil, spart aber deutlich Speicher.
        .buffer_size   = p->h_res * LCD_FLUSH_LINES,
        .double_buffer = false,
        .hres          = hres,
        .vres          = vres,
        .monochrome    = false,
        .color_format  = LV_COLOR_FORMAT_RGB565,
        .rotation = {
            .swap_xy  = swap_xy,
            .mirror_x = mirror_x,
            .mirror_y = mirror_y,
        },
        .flags = {
            .buff_dma    = true,
            .swap_bytes  = true,
        },
    };
    return lvgl_port_add_disp(&dcfg);
}

// ------------------------------------------------------------------
// Monochromes I2C-OLED (SSD1309, SSD1306-kompatibles Protokoll)
// ------------------------------------------------------------------
static lv_display_t *lcd_init_mono_i2c(const board_profile_t *p)
{
    // ESP-IDF >=5.2/6.x: esp_lcd_new_panel_io_i2c erwartet einen
    // i2c_master_bus_handle_t aus dem neuen i2c_master-Treiber, nicht mehr
    // den legacy i2c_port_t (driver/i2c.h). Legacy-API brach auf IDF 6.0.2
    // mit "esp_lcd_i2c_bus_handle_t undeclared" / falscher Parameteranzahl.
    i2c_master_bus_config_t bus_cfg = {
        .i2c_port = I2C_NUM_0,
        .sda_io_num = p->i2c_sda,
        .scl_io_num = p->i2c_scl,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    i2c_master_bus_handle_t bus = NULL;
    LCD_CHECK(i2c_new_master_bus(&bus_cfg, &bus));

    esp_lcd_panel_io_handle_t io = NULL;
    esp_lcd_panel_io_i2c_config_t io_cfg = {
        .dev_addr          = p->i2c_addr,
        .scl_speed_hz      = p->i2c_hz,
        .control_phase_bytes = 1,
        .lcd_cmd_bits      = 8,
        .lcd_param_bits    = 8,
        .dc_bit_offset     = 6,
    };
    LCD_CHECK(esp_lcd_new_panel_io_i2c(bus, &io_cfg, &io));

    esp_lcd_panel_ssd1306_config_t ssd_cfg = { .height = p->v_res };
    esp_lcd_panel_dev_config_t panel_cfg = {
        .reset_gpio_num = -1,
        .bits_per_pixel = 1,
        .vendor_config  = &ssd_cfg,
    };
    esp_lcd_panel_handle_t panel = NULL;
    LCD_CHECK(esp_lcd_new_panel_ssd1306(io, &panel_cfg, &panel));
    LCD_CHECK(esp_lcd_panel_reset(panel));
    LCD_CHECK(esp_lcd_panel_init(panel));
    LCD_CHECK(esp_lcd_panel_disp_on_off(panel, true));

    s_hres = p->h_res;
    s_vres = p->v_res;

    lvgl_port_cfg_t pcfg = ESP_LVGL_PORT_INIT_CONFIG();
    LCD_CHECK(lvgl_port_init(&pcfg));

    lvgl_port_display_cfg_t dcfg = {
        .io_handle     = io,
        .panel_handle  = panel,
        .buffer_size   = p->h_res * p->v_res,
        .double_buffer = false,
        .hres          = p->h_res,
        .vres          = p->v_res,
        .monochrome    = true,
        .color_format  = LV_COLOR_FORMAT_I1,
        .rotation      = { .swap_xy = false, .mirror_x = false, .mirror_y = false },
        .flags         = { .buff_dma = false, .swap_bytes = false },
    };
    return lvgl_port_add_disp(&dcfg);
}

// ------------------------------------------------------------------
// RGB565-Parallel-Panel (nur Guition JC8048W550: ST7262, "auto-init" ohne
// Kommando-Schnittstelle) - ESP32-S3-exklusiv (LCD_CAM-Peripherie), siehe
// SOC_LCD_RGB_SUPPORTED-Guard oben. Anders als die SPI-Panels oben braucht
// dieses Board kein esp_lcd_panel_io_handle_t (kein Command-Bus). Der
// Framebuffer liegt in PSRAM (einziges Board in diesem Projekt mit PSRAM),
// gefuettert per Bounce-Buffer (kleiner SRAM-Zwischenpuffer, siehe panel_cfg
// unten) - der LVGL-Flush selbst laeuft trotzdem wie bei den SPI-Panels
// gepuffert/kachelweise (kein direct_mode, siehe Kommentar dort).
// ------------------------------------------------------------------
#if SOC_LCD_RGB_SUPPORTED
static lv_display_t *lcd_init_rgb(const board_profile_t *p)
{
    backlight_init(p->bl);

    esp_lcd_rgb_panel_config_t panel_cfg = {
        .clk_src = LCD_CLK_SRC_PLL160M,
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 3, 0)
        .psram_trans_align = 64,
#else
        .dma_burst_size = 64,
#endif
        .data_width = 16,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
        .in_color_format = LCD_COLOR_FMT_RGB565,
#else
        .bits_per_pixel = 16,
#endif
        .de_gpio_num = p->rgb_de,
        .pclk_gpio_num = p->rgb_pclk,
        .vsync_gpio_num = p->rgb_vsync,
        .hsync_gpio_num = p->rgb_hsync,
        .disp_gpio_num = -1, // kein separater Panel-Enable-Pin verdrahtet
        .timings = {
            .pclk_hz = p->rgb_pclk_hz,
            .h_res = p->h_res,
            .v_res = p->v_res,
            .hsync_pulse_width = p->rgb_hsync_pulse_width,
            .hsync_back_porch  = p->rgb_hsync_back_porch,
            .hsync_front_porch = p->rgb_hsync_front_porch,
            .vsync_pulse_width = p->rgb_vsync_pulse_width,
            .vsync_back_porch  = p->rgb_vsync_back_porch,
            .vsync_front_porch = p->rgb_vsync_front_porch,
            .flags.pclk_active_neg = true,
        },
        .flags.fb_in_psram = 1,
        // Einzelner Framebuffer + Bounce-Buffer statt zweier voller PSRAM-
        // Framebuffer (Ping-Pong/avoid_tearing): auf realer JC8048W550(C)-
        // Hardware verursachte Letzteres sichtbare Bildstoerungen/Geisterbilder
        // (PSRAM-Bandbreite reicht nicht, wenn CPU/LVGL und die LCD-DMA
        // gleichzeitig auf zwei volle 800x480-Puffer zugreifen). Community-
        // Configs fuer exakt dieses Boardmodell nutzen durchgehend einen
        // kleinen Bounce-Buffer (Vielfaches von h_res=800) in internem SRAM,
        // der zeilenweise aus dem einen PSRAM-Framebuffer nachgefuellt wird -
        // das entkoppelt DMA- von CPU-Zugriffen auf den PSRAM-Bus.
        .num_fbs = 1,
        .bounce_buffer_size_px = (size_t)p->h_res * 10,
    };
    for (int i = 0; i < 16; i++) panel_cfg.data_gpio_nums[i] = p->rgb_data[i];

    esp_lcd_panel_handle_t panel = NULL;
    LCD_CHECK(esp_lcd_new_rgb_panel(&panel_cfg, &panel));

    // Eine saubere Init-Sequenz, damit das oft zitternde JC8048W550-Panel
    // nach Stromlos-Reboot sauber startet.
    LCD_CHECK(esp_lcd_panel_reset(panel));
    vTaskDelay(pdMS_TO_TICKS(50));
    LCD_CHECK(esp_lcd_panel_init(panel));
    vTaskDelay(pdMS_TO_TICKS(50));

    // Panel-native Polaritaet ist bereits korrekt (auf echter Hardware
    // bestaetigt) - KEINE Hardware-Invertierung ueber app_config.color_invert.
    // Anders als bei den SPI-Panels oben (die dort tatsaechlich eine falsche
    // Panel-Polaritaet ausgleicht) dreht eine blanke Hardware-Invertierung
    // hier ausnahmslos ALLE Farben gleich um (z.B. gelbe Sonne -> blau) statt
    // eines brauchbaren "Light Mode". app_config.color_invert wird fuer
    // dieses Profil daher rein in Software als Light/Dark-Theme-Umschalter
    // interpretiert, siehe display_ui_wide.c: init_wide_theme().
    LCD_CHECK(esp_lcd_panel_invert_color(panel, false));
    if (panel_cfg.disp_gpio_num >= 0) {
        LCD_CHECK(esp_lcd_panel_disp_on_off(panel, true));
    }

    // Kein swap_xy (siehe unten), aber alle vier Mirror-Kombinationen zum
    // Durchprobieren freigegeben - analog zu LCD_SHAPE_ROUND oben in
    // lcd_init_color_spi(): welche Kombination auf reale Hardware "richtig
    // herum" abbildet, ist nicht zuverlaessig vorhersagbar (haengt von der
    // internen Scan-Richtung des jeweiligen Panels/Bausatzes ab). Auf dem
    // JC8048W550(C) erwies sich sowohl "keine Korrektur" als auch die zunaechst
    // angenommene mirror_x=true beide als falsch - daher hier wie beim runden
    // UI alle vier Werte ueber die Rotation-Auswahl im Webportal anbieten,
    // statt im Code zu raten. touch_gt911_init() spiegelt die Touch-
    // Koordinaten passend zur selben Zuordnung mit.
    bool mirror_x = false, mirror_y = false;
    switch (app_config.rotation) {
        case 1:  mirror_x = true;  mirror_y = false; break;
        case 2:  mirror_x = false; mirror_y = true;  break;
        case 3:  mirror_x = true;  mirror_y = true;  break;
        case 0:
        default: mirror_x = false; mirror_y = false; break;
    }
    s_hres = p->h_res;
    s_vres = p->v_res;

    lvgl_port_cfg_t pcfg = ESP_LVGL_PORT_INIT_CONFIG();
    LCD_CHECK(lvgl_port_init(&pcfg));

    // Normaler gepufferter LVGL-Flush (wie bei den SPI-Panels oben,
    // esp_lcd_panel_draw_bitmap() schreibt die gerenderte Kachel in den PSRAM-
    // Framebuffer) statt direct_mode: direct_mode setzt voraus, dass LVGL
    // wechselnde Framebuffer synchron mitverwalten kann - auf realer
    // JC8048W550(C)-Hardware fuehrte das sowohl mit zwei vollen Framebuffern
    // (Ghosting) als auch mit nur einem (komplettes Schwarz/Weiss-Flackern +
    // Bildfehler links) zu sichtbaren Stoerungen. Der Bounce-Buffer oben
    // entkoppelt die LCD-DMA ohnehin unabhaengig vom LVGL-Flush-Modus vom
    // PSRAM-Framebuffer, ein kleiner SRAM-Flush-Puffer reicht daher.
    //
    // lvgl_port_add_disp_rgb() (nicht das generische lvgl_port_add_disp()!)
    // ist hier Pflicht: Letzteres asserted intern auf disp_cfg->io_handle !=
    // NULL, das dieses Panel (kein Kommando-Bus) nie hat.
    //
    // control_handle: esp_lvgl_port ruft esp_lcd_panel_mirror()/_swap_xy()
    // NICHT auf panel_handle auf, sondern auf dieses separate Feld (fuer
    // Panels, deren Rotationskommandos ueber einen anderen Bus laufen als die
    // eigentlichen Pixeldaten, z.B. RGB-Panels mit zusaetzlichem 3-Wire-SPI-
    // Init). Ohne dieses Feld (NULL) wird mirror_x/mirror_y unten schlicht
    // NICHT angewendet - genau das fehlte in den vorherigen Versuchen.
    // Unser Panel hat keinen separaten Kommandobus, also derselbe Handle.
    lvgl_port_display_cfg_t dcfg = {
        .panel_handle = panel,
        .control_handle = panel,
        .buffer_size  = (uint32_t)p->h_res * LCD_FLUSH_LINES,
        .double_buffer = false,
        .hres = p->h_res,
        .vres = p->v_res,
        .monochrome = false,
        .color_format = LV_COLOR_FORMAT_RGB565,
        .rotation = { .swap_xy = false, .mirror_x = mirror_x, .mirror_y = mirror_y },
        .flags = {
            .buff_dma   = false,
            .swap_bytes = false,
        },
    };
    lvgl_port_display_rgb_cfg_t rgb_cfg = {
        .flags = { .bb_mode = true, .avoid_tearing = false },
    };
    return lvgl_port_add_disp_rgb(&dcfg, &rgb_cfg);
}
#endif // SOC_LCD_RGB_SUPPORTED

static lv_display_t *lcd_init(void)
{
    if (app_config.display_type == DISPLAY_NONE) {
        ESP_LOGI(TAG, "Kein Display ausgewaehlt - Panel-Init uebersprungen.");
        return NULL;
    }

    s_profile_storage = board_profile_apply_overrides(board_profile_get(app_config.display_type),
                                                        &app_config.pin_overrides);
    s_profile = &s_profile_storage;
    ESP_LOGI(TAG, "Display: %s", s_profile->name);

    if (s_profile->bus == LCD_BUS_I2C) {
        return lcd_init_mono_i2c(s_profile);
    }
#if SOC_LCD_RGB_SUPPORTED
    if (s_profile->bus == LCD_BUS_RGB) {
        return lcd_init_rgb(s_profile);
    }
#endif
    return lcd_init_color_spi(s_profile);
}

// ------------------------------------------------------------------
// Touch -> LVGL-Eingabegeraet (nur Profile mit has_touch=true)
// ------------------------------------------------------------------
static void touch_read_cb(lv_indev_t *indev, lv_indev_data_t *data)
{
    (void)indev;
    uint16_t x, y;
    bool touched = touch_xpt2046_read(&x, &y);

    if (touched && s_standby) {
        // Im Screensaver-Modus reagiert Touch nicht als Aufwecken.
        // Allow objects such as the settings button to still receive input.
    }

    if (touched) {
        data->point.x = x;
        data->point.y = y;
        data->state   = LV_INDEV_STATE_PRESSED;
    } else {
        data->state = LV_INDEV_STATE_RELEASED;
    }
}

// GT911-Pendant zu touch_read_cb oben: gleiche Standby-Aufweck-Semantik
// (erster Touch weckt nur auf, loest keine Aktion aus), aber ueber die
// esp_lcd_touch-Abstraktion statt eines eigenen SPI-Registerzugriffs.
static esp_lcd_touch_handle_t s_gt911_tp;

