kurim/pulse-esp32-hwmonitor/main/display/display_ui.c
static void touch_gt911_read_cb(lv_indev_t *indev, lv_indev_data_t *data)
{
    (void)indev;
    uint16_t x = 0, y = 0;
    uint8_t cnt = 0;
    esp_lcd_touch_point_data_t touch_data;

    esp_lcd_touch_read_data(s_gt911_tp);
    bool touched = esp_lcd_touch_get_data(s_gt911_tp, &touch_data, &cnt, 1) == ESP_OK && cnt > 0;
    if (touched) {
        x = touch_data.x;
        y = touch_data.y;
    }

    if (touched && s_standby) {
        // Im Screensaver-Modus reagiert Touch nicht als Aufwecken.
        // Allow objects such as the settings button to still receive input.
    }

    if (touched) {
        data->point.x = x;
        data->point.y = y;
        data->state   = LV_INDEV_STATE_PRESSED;
    } else {
        data->state = LV_INDEV_STATE_RELEASED;
    }
}

// ------------------------------------------------------------------
// Navigationstaste (nur Profile ohne Touch mit nav_button>=0, aktuell nur
// GC9A01: BOOT-Taste des Devboards). Taste zieht beim Druecken gegen GND
// (interner Pullup) - erster Druck nach dem Standby weckt nur auf (analog
// zu touch_read_cb), im Wachzustand schaltet sie zwischen den Screens des
// runden Minimal-UIs um (siehe display_ui_round.c: round_ui_cycle_screen()).
// Wird per eigenem 150ms-Timer gepollt (nicht ueber den 1Hz-tick_cb, damit
// sich Tastendruecke nicht traege anfuehlen).
// ------------------------------------------------------------------
static bool s_nav_btn_prev_high = true;

static void nav_button_init(const board_profile_t *p)
{
    if (p->nav_button < 0) return;
    gpio_config_t io = {
        .pin_bit_mask = 1ULL << p->nav_button,
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_ENABLE,
    };
    gpio_config(&io);
}

static void nav_button_cb(lv_timer_t *t)
{
    (void)t;
    bool level_high = gpio_get_level(s_profile->nav_button) != 0;
    if (!level_high && s_nav_btn_prev_high) {
        // Fallende Flanke = Tastendruck.
        if (s_standby) {
            exit_standby();
        } else if (s_profile->shape == LCD_SHAPE_ROUND) {
            round_ui_cycle_screen();
        }
    }
    s_nav_btn_prev_high = level_high;
}

// ------------------------------------------------------------------
// Gemeinsame Style-Helfer (auch von display_ui_rect/_round/_mono.c genutzt,
// siehe display_ui_internal.h)
// ------------------------------------------------------------------
void style_screen(lv_obj_t *scr)
{
    lv_obj_set_style_bg_color(scr, COL_BG, 0);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);
    lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLLABLE);
}

lv_obj_t *make_label(lv_obj_t *parent, const char *txt, const lv_font_t *font, lv_color_t col)
{
    lv_obj_t *l = lv_label_create(parent);
    lv_label_set_text(l, txt);
    lv_obj_set_style_text_font(l, font, 0);
    lv_obj_set_style_text_color(l, col, 0);
    return l;
}

// ------------------------------------------------------------------
// Dispatch: 1x/Sekunde Refresh + Standby-Check, unabhaengig vom Panel-Typ.
// ------------------------------------------------------------------
static void tick_cb(lv_timer_t *t)
{
    (void)t;
    check_standby();
    switch (s_profile->shape) {
        case LCD_SHAPE_MONO:  refresh_mono_ui();  break;
        case LCD_SHAPE_ROUND: refresh_round_ui(); break;
        case LCD_SHAPE_WIDE:  refresh_wide_ui();  break;
        default:              refresh_now();      break;
    }
}

void display_ui_begin(void)
{
    lv_display_t *disp = lcd_init();
    if (!disp) {
        // DISPLAY_NONE (lcd_init() hat bereits geloggt) oder Panel-Init
        // fehlgeschlagen (z.B. Profil mit auf diesem Chip nicht existierender
        // GPIO-Nummer, siehe LCD_CHECK oben). In beiden Faellen bewusst NICHT
        // abbrechen: das Geraet soll trotzdem WLAN/Webportal starten, damit
        // sich der Displaytyp dort (aus)waehlen/korrigieren laesst, statt in
        // einer Boot-Schleife ohne jede Erreichbarkeit haengen zu bleiben.
        if (app_config.display_type != DISPLAY_NONE) {
            ESP_LOGE(TAG, "Kein Display initialisiert - Webportal bleibt trotzdem erreichbar, "
                          "Displaytyp dort korrigieren und neu starten.");
        }
        return;
    }

    esp_lcd_touch_handle_t gt911 = NULL;
    if (s_profile->has_touch) {
        if (s_profile->bus == LCD_BUS_RGB) {
            gt911 = touch_gt911_init(s_profile);
        } else {
            touch_xpt2046_init(s_profile);
        }
    }
    nav_button_init(s_profile);

    // Sprache vor dem Bauen der Screens setzen - Screens werden nur einmal
    // gebaut, eine spaetere Aenderung von app_config.language greift erst
    // nach einem Neustart (siehe ui_strings.h).
    ui_set_language(app_config.language);

    // Ab hier LVGL-Objekte nur unter Lock anlegen (esp_lvgl_port-Task laeuft).
    lvgl_port_lock(0);

    if (s_profile->bus == LCD_BUS_RGB) {
        if (gt911) {
            s_gt911_tp = gt911;
            lv_indev_t *indev = lv_indev_create();
            lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
            lv_indev_set_read_cb(indev, touch_gt911_read_cb);
            lv_indev_set_display(indev, disp);
        }
    } else if (s_profile->has_touch) {
        lv_indev_t *indev = lv_indev_create();
        lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
        lv_indev_set_read_cb(indev, touch_read_cb);
        lv_indev_set_display(indev, disp);
    }

    switch (s_profile->shape) {
        case LCD_SHAPE_MONO:
            build_mono_ui();
            lv_screen_load(scr_main);
            break;
        case LCD_SHAPE_ROUND:
            build_round_ui();
            lv_screen_load(scr_main);
            break;
        case LCD_SHAPE_WIDE:
            build_wide_ui();
            lv_screen_load(scr_main);
            break;
        default:
            build_main();
            build_detail();
            build_settings();
            build_standby();
            lv_screen_load(scr_main);
            break;
    }

    lv_timer_create(tick_cb, 1000, NULL); // 1x/Sek aktualisieren
    if (s_profile->nav_button >= 0) {
        lv_timer_create(nav_button_cb, 150, NULL); // schnelleres Polling fuer reaktionsfreudige Taste
    }
    tick_cb(NULL);

    lvgl_port_unlock();
    ESP_LOGI(TAG, "UI initialisiert (%s)", s_profile->name);
}